
{
  "1.1": {
    "titulo": "Commit",
    "contenido": [
      { "tipo": "p", "texto": "Un commit es una captura del estado actual del proyecto." },
      { "tipo": "img", "src": "img/contenido/commit.jpg" },
      { "tipo": "p", "texto": "Ayuda a registrar cambios y su historial." },
      {
        "tipo": "ul",
        "items": [
          "Elemento A",
          "Elemento B",
          "Elemento C"
        ]
      },
      {
        "tipo": "ol",
        "items": [
          "Paso 1",
          "Paso 2",
          "Paso 3"
        ]
      },
      {
        "tipo": "code",
        "texto": "console.log('Hola mundo');"
      },
      {
        "tipo": "quote",
        "texto": "La programación no se trata de lo que sabes, sino de lo que puedes descubrir. – Chris Pine"
      }
    ]
  },
"1.2": {
    "titulo": "Repositorio",
    "contenido": [
{"tipo":"p", "texto": "es el área donde se guarda la versión del archivo cuando se hace el commit. El directorio de git contiene los metadatos y las versiones del proyecto, también es la parte que se copia a local cuando clonamos el repositorio desde GitHub."},
      {"tipo": "h3", "texto": "Crea un repositorio local"},
      { "tipo": "p", "texto": "Para crear un repositorio hay que posicionarse en la carpeta que lo va contener y escribir el comando git init, a partir de ese momento convertimos esa carpeta en un repositorio y empezamos a rastrear distintas versiones de los archivos de esa carpeta.  " },
     { "tipo": "p", "texto": "El repositorio de un proyecto se encarga de guardar distintas versiones del mismo y, tambien ramas paralelas que pueden o no ser sincronizadas con la principal, y esto es util para hacer pruebas cuando se hacen cambios en el codigo de algun archivo" },
     { "tipo": "p", "texto": "Los repositorios puede ser de 3 tipos: local(local)Cuando se crea en nuestra pc, remoto(remote)  cuando esta ubicado en la pagina de github y bifurkado(fork) cuando es forkeado de un perfil de github diferente al nuestro y desde donde nuestra copia va recibir actualizacion o a donde podremos hacer pull request" },
    {
      { "tipo": "img", "src": "img/contenido/imagen.jpg" }
    ]
  }
  "1.22": {
    "titulo": "Branch",
    "contenido": [
      { "tipo": "p", "texto": "Una rama permite desarrollar características por separado." }
    ]
  },
  "2.1": {
    "titulo": "Etiquetas HTML",
    "contenido": [
      { "tipo": "p", "texto": "Las etiquetas definen la estructura del contenido." },
      { "tipo": "img", "src": "img/contenido/html1.png" }
    ]
  },
  "2.2": {
    "titulo": "Formularios",
    "contenido": [
      { "tipo": "p", "texto": "Permiten enviar datos a un servidor." }
    ]
  }
}
